#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "6431882f64af7621924d79926a051d26" -> "f0c558d97f3a8854a7a53f834c8222bc"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "eba17bedaa876461815aff38af9cdf3c" -> "1ee90043a53c74a0b8e93db6949f40a1"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "a25acb5d65e31105d60012e14d12a4a2" -> "c7f45e938ffa783cbc71250fe275aa13"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "36d8061e19e395c08720276b0ce4f518" -> "4bb32125d801cf4c906bcf6fd8ff60d3"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "f120c4c4f8483aec4a578918c374231b" -> "76bb0d5a20d66bdf44d3a2e263947dc5"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "4a2d5d94346f0b36f8869c074653ced8" -> "84f69808898a0045e23afcce1e83d2c3"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "f05134f92c4071046f3f2a809229d4bc" -> "7db58993d97547fdf5086dde3afc60a8"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "c24dcb33ed514b9396a02b97e1ba13a7" -> "e49dcd08083ff60b603aeb0e0e2fd2be"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "1dacb7da3c874aa48b9ab44ec2b167ad" -> "92dbea18f7be925d837ae16f6e5d7a4b"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "9f0446809da4714c2528381258c0de4b" -> "8fff5bc06d4ffc13a5d4487918c1a88f"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "e31a8a84134b9be1e82b4a8fee8b7f2c" -> "a7587e2414c8ced9d849ea211dada0a5"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "97968caee05cbea390b63b2fbb747ba3" -> "573f72b28175904cfbaea2c2619b873d"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "2b9bcde09a7d832731c933d0e26b3ef2" -> "017232072db7ffbf005ca7282b6fae80"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "fc92b076d2fa93951b37a16b9e93175b" -> "2ffa64d03a6350fa127a891d7f337d56"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "804692e7011b8e3a2f1bef62d635a3eb" -> "e10529d26e7a9f9e6d893902dfd10457"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.etl_script_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "etl_script_object" {
      ~ etag               = "3e64822f9e7de7ad06d92a2f2623c305" -> "f29b52ed998b67b9a9965a5ad1f9fdb5"
        id                 = "pyspark/kpinetwork_analizer.py"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "f82acf9b749d39dc20d262de1ad930c3" -> "14c7efe96b9e86e6920d2d04c40cf243"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "928486a82ba0384126939b8604ccf97a" -> "66fd7dcf115acb3b697e83e6f439287c"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "ee550829385a3794e2b5fa42955d56d2" -> "38395c8459c5d3e4ca8cf2586b105907"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "e4ac811c9717bea79b0bf1dc8e881c94" -> "169bcd073c016720ecfba6440cc32a07"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "f800188ad1752f141eb80c84b9cb4d1b" -> "8482ce0deab1098f75c7d38aa25eea4b"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "8a5f2bf25a66da5e6373788ccf6e448d" -> "42184af4d97bb5c2e6b71a427067e92f"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "d4063c29a163810510582878b3a7df8e" -> "30e7adcc7323c91cad7d6fef6dc25e58"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "4dfda2672beefc45f88eef6f5e2bfc48" -> "0f75d01e3c73e58327178b3bd9094c60"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "8e71cb4b89a60ba375c377858fdc5290" -> "f6e437597b1f3e5c6e003d86817defaa"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "dcb14723b5fc484199d1c1ad2d9dc36d" -> "49b138dc59b90f23573f31b33c7be42a"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "075c77b086e95d2d6271c49e674d9dc8" -> "e13c7fbf4417b85c2d4702e33d241b93"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "50cf14fa75e3fcb2721d2950c0890d86" -> "29380ef60daf6d13023f9ed14c6c5140"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag               = "be0d051318471aa157c612afaa90b1c7" -> "542ce31f5ae8514a8a755144a28566ab"
        id                 = "lambdas/demo/get_full_year_total_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "7679aa337cf924d1430a28eaf5d9be50" -> "cdc2acfa5a134f7b6c1c90fb14956d18"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "a49351fe18204f308ad1cc274697fe17" -> "14b967ec09c7d90f7870e858e3a98104"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "48cbd1f4e3599b59413b07e41225121f" -> "e15bf0f55bc8c66cda8549c5cace60b4"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "decfe4b2de9307351ea672f44bee7f7c" -> "3df386f002fe8830e38b3269406da078"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "a924036a35814b94418327f238f28b93" -> "5575af333c539674650b73ecc43b4cf7"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "26b6d7290f0f1e278d39df54342c4e5a" -> "8ad2b5305860e3c89d731693f294618c"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "f0370ac7fcbb2cc38041165dd33e1687" -> "9695e7903c5a827af2f8099375220b67"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "2be272c8219dc697fb532f251f19d6ec" -> "4b57c445bb91266794332309d726ba82"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "1a46fe34158cb52a15cdc452647b8a84" -> "b1f6745300d15c613543c8dcf4212359"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "f1d3b644ee738245a8ba9a6fe209769c" -> "7208001f9ba3f5c679edc8ea2fb5a1fb"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "0410ad73d579cb00b94b74367ce47833" -> "ece1d4d17de3558fa1a9b442bb89930d"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "d9b95dc935c62aae2ed3361643c84c99" -> "4fd1a559f6bd96146356c19a4a17a5d8"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "ee9759247f5f0e8559af2c7948c39794" -> "50a7d1ecb9d17901f98ffc9858837334"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "ed8a0b28139d35ba6424496d49e89f0e" -> "efb698a2140d9f48bf0e32c424d3e686"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "2a05f33a9cbadd3905e6654aafd54170" -> "94659b4975e2d47a246a5f961051de55"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "2495b8fd4e5474f876a4a52f558ca46f" -> "fdd0bd2018941afc04cca6afa8c8aafe"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "b97184d92065edf710bffb88f02df6fd" -> "f4eb489a00d5cc8e6000394087aa63d8"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "7737e7c7f175e50ac7fbd38620c1784c" -> "92d27de184ca6502ea84b62778228ff5"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.codebuild.aws_codebuild_source_credential.git_credential must be replaced
-/+ resource "aws_codebuild_source_credential" "git_credential" {
      ~ arn         = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ id          = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ token       = (sensitive value) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "rDqb33ozX0a/Sw6hcIoDrCTXzc5payp5Atpv2KXyZMQ=" -> "zrsCglKR2eYsg1eDdgSew8dWpaBHZym2fuc0EF/dVKA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "mbAWEGWXPK1Qzbl9MBClG8f9IuLMU5MXBaFBxVV9qx8=" -> "pjugzuNgrm3jOR9yQpI+LRIyAn7pWxsZLiOQ6FpoBdg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "xwaIAUlpzlUHvV3VI2Smy9HQYSe/fXnVNxRzjvBkS4Q=" -> "aOMSVTrC1PEwQPDqBfD1EU6HdYPcPozBaDppzSzfB3s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "INKhUfDYNqVQAAhOBqCBNED0hpKWScsamuKzMH7Nd/Q=" -> "2kAO5H2yF0f2oSnWGwQPJMxlIEGodNJnkBW8HeJf3vY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "afctkexUfsgHYiDaWJDsC3KE978+36qaOTYp5NI4vyI=" -> "wT1K87JwpJTre7U5kQ3awNJFb827EFphO6FU6u6YJEU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "1kn+whYSweQQ9j9cZiGtG4EjX0qqmfIqnDcsZZ6KSrw=" -> "71uhad1vXCZPgsXr2rOTP6tkuSwUP4Kuk/zFb4hchcs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "vIxf+oxAmgpVcbH16yvUN0K59zRnlnAiWYQVP+Uj0IY=" -> "t/XwdRinDUBVjMYvAtgSmjBap7LKlP2gShHq3dbIioE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "TmjynSuJ0e5z1RPqiA5dxKzmSmaB2CWWpcTphI4R87Y=" -> "9JeJBhF+YiDHjAbvqfBiV1nyyIy4cn7QHE65Rd33E+M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "dRhMhzMniHq3kH4bXJj17s+lq1OImy/fYcfJCol50WA=" -> "AKiuauBWnCF0jOHzGuBhnwc/Nmom7pVllYlel3ZmCqA="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "EqLDsYq6AZT44NZKMdgB6u9+ShiTDSYxbasBowVzO3Q=" -> "uz3zAJLym1DvvCt9Bg/ZHcbarG9wxQs86pdXcpkzK1M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "ag+xYDGqm2uyUz7JBj31hSYBHu7MEda07lgV/HXZwJs=" -> "lrFFLKyF71SFi8XL9MgHDk/LgwpUZaITrbz82vvydfY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "X0pPP9d1LHtaf5uTbfvv4Xc0oRU3tqQJzPjuP5ucuTk=" -> "hxzEeo7r/Tj7b6iy1an4WyZ3rz7IRjt5bqvX4J1uAsU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZrZLB2tv1SQirIarirzWbZPulRQ9195aSWhnV0vKZTk=" -> "A1eNHZy4Or1hT/h/H3YxZLlC8ZzvUOSnaSdK5SWhC60="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "DBG3FKZeKOJNdotKGhMhLRIgEOSSebrIN9AKZ6WbFO0=" -> "RpzRUX0cZdlq+Rh7lMUPhSyWK/1eC1RonppGnu9pX+Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "AIuZ3GlgbUGQOZZwHFYmLIPRS1QnVNdnSbjFPkOs5zU=" -> "EFY3yz3Za2bPIIPLTvNSioRrwmz64PIiaMQcl6oSXno="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "S+okPOHrzOngmtnSwIoYeBKG84t7hyDroAi/80vIgeg=" -> "XKRpe439hTdLkGP1PyGBQXeZIMktj6LuaS5pIIpelyg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "5oMZcVJyOyOD2zoQmcoJYb41M8yYJUiWLBBA6pV4afg=" -> "umr6yw1I296L/bVd8JUSk1gMNsZ2p6OgY4NtPAbDOiA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "/A6L2fMHKv7z23dMdVyXsaBAahkTj5l3QGrkpY9/jJs=" -> "VSNEjybOXSTS4nhJxLpXFXY6Og2CHt+hzzm/PSQCuVo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "lDHvcQKKxxGCD500FwItTiT67IoGUCE6VcmT1ozVomE=" -> "Z1+EFJteDVoVZ4JDcxj0/iYQ5kiDK5CUn0YMwxStTXM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "392AfyCbuTJxG298SnNnt2UV0/X0hIxXaFy65JdkW6c=" -> "xZEkyaBj2hmtusvy7425i70ZdR+6Ve9awWFtNhcSitc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-01-11T02:15:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "/BEvbsG30GDrfGtUZ8Gh/+kbHow41RYHe4SFzySnBT8=" -> "HfcvMI0a0Qj7eCADla7ci9mTrdF2Sjnvuq+HfiqZ5co="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "rvQUmMqhyBPlIVyoYDaLu4YKoa+81AR9sdfAQiUUGII=" -> "7JtqwjQx+hh79Cc9bHv2oks6rUXrud4DtvRcPKcdzmM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "O9w/C8nigSd/KvU+eUfcGYp1RW96eyiV9J3VZSHB8G0=" -> "zlL29Rm8mmQ1Qv3D9uJmiME4nhsAbyC61o7ReQyxCuM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "y8qy26iTY4maHlXOtP2uC+vAIHfSzWMSpRlp/Yl/FZ0=" -> "TUHb9KAbQp4FHWRa8MzYhXK3vnrPdUmrdg9lD/DCRro="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "+7RQk09Ld1OwdeP6Sx41zG9wPnp3blLKFW6rW13fD94=" -> "eVcLvmPomUrAyaykguCiMBz3Cuc1T01AxYMg3HLZmxA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "hbaI97J7SwZ3F1oAxQHAkydCNOsceqTGWjyya8tDBzI=" -> "m1w27zHH482BOJRsge49EMLMidK2qka1FaxYnSlUsNU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "fLa1w7DbEy0DV8A6xS5s/CfIZCBUOPZBm+JXRMch8so=" -> "4Ys67pRb/OsoFdaQ2I6MPfRs+z0Qu0bvizovoVt4GqA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "f1BFU6lDakX/t9KxofgTVFKXJ44JzQz79fudbEr0twk=" -> "GfGtLZY8/g5X8CPrvxqFvqNpF8FhFsdZojeqFPwkupA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "LptOGTlp2yo+TeDeTzxYMjCOifoyIszBqWjw+wfNlvY=" -> "l8/OTlRY2SJqt9ipzv6Ro2pgTa1kw0WeRCdcFTbMjDs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "wTbNy/cJislrvDDrGkvOCMn7kmvXQKe4gz/ZC9np+2A=" -> "iuHwIKOp+6bKcUPku4QGNzf3/c34YC1+hc76/p2O3iM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "I4kixPMWiYBXzvGDF2iyndwWG1Z4xjAZgFPg+ZDKSb4=" -> "OF5hyz9bw+4tnmJ/FWCdrcbtTAWUfsxJ6GfF2kcE2uw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "IZ3AdwM4GCv34fPNKZmutCZl66mfuPD8h9n73/JNrYw=" -> "mw/3FEBbfyuRxThdlCNArOsBwcqS86r41195XjypHGM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "KwUVEhsR5asJcHnUrYjWtMlS71T7ZPILZpeH8bf/17I=" -> "jW044p64O3rmr0GBQUhdO86Z09Unp0zGsi5rUWyoTjw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "v23u/BjasWbXWFsbe6GMgfZTPxxnF1phohW5k62rWSs=" -> "rH8gIzOsQ+bXEQQFTl8+5LEdqFdvjHK3L8ukNs8l0jM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q3anz468Y1zvkSoFRJkZvW3MRJ7Zq0ycqcp6NgkGhSQ=" -> "DOravzC0EXknGF7mF5z+CpULhXMsCJkRrTcQPk0JQZ8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "SdNV7Jex3TSTjQ0uGLsOfHOLzF6qs27OFRAKqi/3/Bg=" -> "vbEYpUPY5fmXuAJRnT75jwPgF3IXOYjC3fG1BTQOcTE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "da0LjGCf2dHubVQXiIWmVPzC6d/el0zqIhvW/NJ6Xgo=" -> "MLjSnn+WJDd6wacMqI8f/ljOATFI4gZx0HRSfCEUAxY="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "WiwCd7SKsIP/Spc5urB0c8PxWzPGvkuNK7oJemB5yPk=" -> "9k9T2GHOF77j00WiARxUZ04LKulkQ9OCi2phEa9NhPQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "4URzcW7IcsfkHvXH9DIl5X2kjUSwraVAWGCDPSfkCj0=" -> "4IEtAtAT7kUlbTIlszPjwZPENsSGIybFFbWc1qtIyU0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "MG4JqipdQyi8Yy0qxhPVpD995ZAQ43I9ESShTatKV8E=" -> "jxMO0NyHg7w2elPNtP1JoQIZDGttWLEcOL+Hf3JXj6Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "6Bt4IRY6A75WjxGDs+ejwLoR5PMfVDIoSWhcBs89OwI=" -> "maa2z+xSMWY4BuPaOu4tfdmMCgIEGXBzKYFX8lbwwAw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "IoojPLlydtJb6kTypZEzBDVHL8VgygComOd0A6NfeLY=" -> "Ki99KuFo9vPzCfXSLoc5kt3jZaroQW0VV+ePcNuJ9vE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "1TP/Ao2lorYEvSKWGKW8LGXwMgyG046k0jCgo/Xw6Oc=" -> "Gf0EiYcrDNeTTq2lh9W3K62Lgh9sOVr2wtlatkOvDbI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "k+2xccoXn6njJZccO7526JZWoFQ1B3pj/KZ5D74dWbo=" -> "sO16W3KrWBdDu1T7I5/1sp/qUcBhp/75u7z/7lV++HE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "l05RXpzxMjqFE2BanWDkseuknsxSCL+xkVJ7JWIBGhg=" -> "4fAmp1wywVVO/b5KFxe+SKc+B9jMdxKyi4/meuF2CbA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-01-09T18:28:05Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "9e0q7u" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-01-09T18:28:02Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_integration.get_full_year_total_integration must be replaced
-/+ resource "aws_api_gateway_integration" "get_full_year_total_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "fi0guw" -> (known after apply)
      ~ id                      = "agi-kb7gblbu69-fi0guw-GET" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ resource_id             = "fi0guw" -> "giqb91" # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_full_year_total_method must be replaced
-/+ resource "aws_api_gateway_method" "get_full_year_total_method" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-kb7gblbu69-fi0guw-GET" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {
          - "method.request.querystring.metric"   = false
          - "method.request.querystring.scenario" = false
          - "method.request.querystring.year"     = false
        } -> null
      ~ resource_id          = "fi0guw" -> "giqb91" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_resource.full_year_by_company will be destroyed
  # (because aws_api_gateway_resource.full_year_by_company is not in configuration)
  - resource "aws_api_gateway_resource" "full_year_by_company" {
      - id          = "fi0guw" -> null
      - parent_id   = "giqb91" -> null
      - path        = "/full_year/{company_id}" -> null
      - path_part   = "{company_id}" -> null
      - rest_api_id = "kb7gblbu69" -> null
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-01-09T18:28:02Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_lambda_permission.apigw_get_full_year_total_lambda must be replaced
-/+ resource "aws_lambda_permission" "apigw_get_full_year_total_lambda" {
      ~ id            = "AllowExecutionFromAPIGateway" -> (known after apply)
      - qualifier     = "" -> null
      ~ source_arn    = (sensitive value) # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 5 to add, 94 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*